###############################################################
#  Generated by:      Cadence Innovus 17.11-s080_1
#  OS:                Linux x86_64(Host ID ce-epo3-cad.ewi.tudelft.nl)
#  Generated on:      Thu Jan 19 09:54:39 2023
#  Design:            pixel
#  Command:           saveDesign ../out/pixel.enc
###############################################################
current_design pixel
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 30.000000 -waveform {0.000000 15.000000}
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {data_in}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {data_in}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {data_in}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {data_in}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {clk15k_in}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {clk15k_in}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {clk15k_in}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {clk15k_in}]
set_load -pin_load -max  1  [get_ports {data_switch}]
set_load -pin_load -min  1  [get_ports {data_switch}]
set_load -pin_load -max  1  [get_ports {clk15k_switch}]
set_load -pin_load -min  1  [get_ports {clk15k_switch}]
set_load -pin_load -max  1  [get_ports {R}]
set_load -pin_load -min  1  [get_ports {R}]
set_load -pin_load -max  1  [get_ports {G}]
set_load -pin_load -min  1  [get_ports {G}]
set_load -pin_load -max  1  [get_ports {B}]
set_load -pin_load -min  1  [get_ports {B}]
set_load -pin_load -max  1  [get_ports {V}]
set_load -pin_load -min  1  [get_ports {V}]
set_load -pin_load -max  1  [get_ports {H}]
set_load -pin_load -min  1  [get_ports {H}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {data_in}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {reset}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {clk15k_in}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {B}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {V}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {R}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {data_switch}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {clk15k_switch}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {G}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {H}]
