###############################################################
#  Generated by:      Cadence Innovus 17.11-s080_1
#  OS:                Linux x86_64(Host ID ce-epo3-cad.ewi.tudelft.nl)
#  Generated on:      Tue Jan 17 09:25:10 2023
#  Design:            top
#  Command:           saveDesign ../out/top.enc
###############################################################
current_design top
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 30.000000 -waveform {0.000000 15.000000}
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {Data_in}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {Data_in}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {Data_in}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {Data_in}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {Clk15k}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {Clk15k}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {Clk15k}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {Clk15k}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {reset}]
set_load -pin_load -max  1  [get_ports {DataSwitch}]
set_load -pin_load -min  1  [get_ports {DataSwitch}]
set_load -pin_load -max  1  [get_ports {ClkSwitch}]
set_load -pin_load -min  1  [get_ports {ClkSwitch}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {countlow}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {countlow}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {countlow}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {countlow}]
set_load -pin_load -max  1  [get_ports {rescount}]
set_load -pin_load -min  1  [get_ports {rescount}]
set_load -pin_load -max  1  [get_ports {output_color[2]}]
set_load -pin_load -min  1  [get_ports {output_color[2]}]
set_load -pin_load -max  1  [get_ports {output_color[1]}]
set_load -pin_load -min  1  [get_ports {output_color[1]}]
set_load -pin_load -max  1  [get_ports {output_color[0]}]
set_load -pin_load -min  1  [get_ports {output_color[0]}]
set_load -pin_load -max  1  [get_ports {tempx[3]}]
set_load -pin_load -min  1  [get_ports {tempx[3]}]
set_load -pin_load -max  1  [get_ports {tempx[2]}]
set_load -pin_load -min  1  [get_ports {tempx[2]}]
set_load -pin_load -max  1  [get_ports {tempx[1]}]
set_load -pin_load -min  1  [get_ports {tempx[1]}]
set_load -pin_load -max  1  [get_ports {tempx[0]}]
set_load -pin_load -min  1  [get_ports {tempx[0]}]
set_load -pin_load -max  1  [get_ports {tempy[3]}]
set_load -pin_load -min  1  [get_ports {tempy[3]}]
set_load -pin_load -max  1  [get_ports {tempy[2]}]
set_load -pin_load -min  1  [get_ports {tempy[2]}]
set_load -pin_load -max  1  [get_ports {tempy[1]}]
set_load -pin_load -min  1  [get_ports {tempy[1]}]
set_load -pin_load -max  1  [get_ports {tempy[0]}]
set_load -pin_load -min  1  [get_ports {tempy[0]}]
set_load -pin_load -max  1  [get_ports {draw}]
set_load -pin_load -min  1  [get_ports {draw}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {Clk15k}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {Data_in}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {reset}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {countlow}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {tempy[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {output_color[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {tempx[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {tempx[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {tempy[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {tempy[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {output_color[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {draw}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {rescount}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {tempx[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {tempx[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {ClkSwitch}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {DataSwitch}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {tempy[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {output_color[2]}]
